foamLia/test/testCase1/0/T
/*--------------------------------*- C++ -*----------------------------------*
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class volScalarField;
location "0";
object T;
}

// ************************************************************************* //

dimensions [0,0,0,1,0,0,0];;
internalField uniform 300;;
boundaryField 
{
    front 
    {
        type empty;
    }
    back 
    {
        type empty;
    }
    topinside 
    {
        type groovyBC;
        value uniform 300;
        gradientExpression "gradT";
        fractionExpression "0";
        variables "Text=280;hc=225;gradT=(Text-T)*hc;";
        timelines ();
    }
    topoutside 
    {
        type groovyBC;
        value uniform 300;
        gradientExpression "gradT";
        fractionExpression "0";
        variables "Text=280;hc=225;gradT=(Text-T)*hc;";
        timelines ();
    }
    bottominside 
    {
        type groovyBC;
        value uniform 300;
        gradientExpression "gradT";
        fractionExpression "0";
        variables "Text=340;hc=225;gradT=(Text-T)*hc;";
        timelines ();
    }
    bottomoutside 
    {
        type groovyBC;
        value uniform 300;
        gradientExpression "gradT";
        fractionExpression "0";
        variables "Text=340;hc=225;gradT=(Text-T)*hc;";
        timelines ();
    }
};

// ************************************************************************* //

