foamLia/test/testCase1/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    topinside
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    topoutside
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    bottominside
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    bottomoutside
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
